# 1. Introduction to Pandas
Pandas is a library specializing in data manipulation and analysis, using two powerful data structures: series and dataframe. Pandas is always used with NumPy.

## 1.1. Series
Series can be thought as 1-dimensional arrays with index.

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.Series(['a', 'b', 'c', 'd', 'e'])

0    a
1    b
2    c
3    d
4    e
dtype: object

In [3]:
pd.Series(np.arange(5), name='digits')

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
Name: digits, dtype: int64

## 1.2. Data types
Like array, series contains elements of homogeneous data types.

In [4]:
import numpy as np
import pandas as pd

#### String

In [5]:
pd.Series(['a', 'b', 'c'])

0    a
1    b
2    c
dtype: object

In [6]:
pd.Series([1, 2, 3]).astype(str)

0    1
1    2
2    3
dtype: object

#### Numeric

In [7]:
pd.Series(['01', '02', '03']).astype(int)

0    1
1    2
2    3
dtype: int64

In [8]:
pd.Series(['01', '02', '03']).astype(float)

0    1.0
1    2.0
2    3.0
dtype: float64

#### Date and time

In [9]:
pd.Series(['2020/01/01', '2020/01/02']).astype('datetime64')

0   2020-01-01
1   2020-01-02
dtype: datetime64[ns]

In [10]:
pd.to_datetime(pd.Series(['Jan.01-2020', '20200102']))

0   2020-01-01
1   2020-01-02
dtype: datetime64[ns]

#### Boolean

In [11]:
pd.Series([1, 0, 0, 1, 1]).astype(bool)

0     True
1    False
2    False
3     True
4     True
dtype: bool

#### Categorical
The categorical data type contains ordered items.

In [12]:
medal = pd.Categorical(
    values=['Gold', 'Bronze', 'Silver', 'Bronze', 'Gold', 'Gold', 'Bronze', 'Silver'],
    categories=['Bronze', 'Silver', 'Gold']
)

medal.sort_values()

['Bronze', 'Bronze', 'Bronze', 'Silver', 'Silver', 'Gold', 'Gold', 'Gold']
Categories (3, object): ['Bronze', 'Silver', 'Gold']

## 1.3. Dataframe
Dataframe is a tabular data type, containing series placed side by side. A dataframe can be thought as a labeled matrix. Here is the dataframe axes convention:
- Axis 0 is the vertical axis, contains row names; each row is called a record or an observation
- Axis 1 is the horizontal axis, contains column names; each column is called an attribute, a field, a variable or a dimension.

In [13]:
import numpy as np
import pandas as pd

#### Manually creating dataframes

In [14]:
dfTemp = {
    'product': pd.Series(['Laptop', 'Mouse', 'Headphone', 'USB']),
    'price': pd.Series(['$1000', '$20', '$50']),
    'stock': pd.Series([15, 100, 50, 100])
}
pd.DataFrame(dfTemp)

     product  price  stock
0     Laptop  $1000     15
1      Mouse    $20    100
2  Headphone    $50     50
3        USB    NaN    100

#### Reading Excel files

In [15]:
pd.read_excel('data/world_population.xlsx').head()

   year      country  population
0  1960  Afghanistan     8996351
1  1961  Afghanistan     9166764
2  1962  Afghanistan     9345868
3  1963  Afghanistan     9533954
4  1964  Afghanistan     9731361

#### Reading CSV files
CSV stands for "Comma-Separated Value".

In [16]:
pd.read_csv('data/finance_charts_apple.csv').head()

,Date,AAPL.Open,AAPL.High,AAPL.Low,AAPL.Close,AAPL.Volume,AAPL.Adjusted,dn,mavg,up,direction
0,2015-02-17,127.489998,128.880005,126.919998,127.830002,63152400,122.905254,106.741052,117.927667,129.114281,Increasing
1,2015-02-18,127.629997,128.779999,127.449997,128.720001,44891700,123.760965,107.842423,118.940333,130.038244,Increasing
2,2015-02-19,128.479996,129.029999,128.330002,128.449997,37362400,123.501363,108.894245,119.889167,130.884089,Decreasing
3,2015-02-20,128.619995,129.500000,128.050003,129.500000,48948400,124.510914,109.785449,120.763500,131.741551,Increasing
4,2015-02-23,130.020004,133.000000,129.660004,133.000000,70974100,127.876074,110.372516,121.720167,133.067817,Increasing

#### Reading JSON files
JSON stands for "JavaScript Object Notation". JSON files have the same structure as Python dictionaries. In Pandas, the `read_json` function reads JSON files and the `DataFrame.from_dict` function reads dictionaries.

In [17]:
dfTemp = {
    'word': {'0':'Python','1':'Jupyter','2':'Anaconda'},
    'length': {'0':6,'1':7,'2':8}
}
pd.DataFrame.from_dict(dfTemp, orient='columns')

       word  length
0    Python       6
1   Jupyter       7
2  Anaconda       8

In [18]:
dfTemp = {
    '0': {'word':'Python', 'length':6},
    '1': {'word':'Jupyter', 'length':7},
    '2': {'word':'Anaconda', 'length':8}
}
pd.DataFrame.from_dict(dfTemp, orient='index')

       word  length
0    Python       6
1   Jupyter       7
2  Anaconda       8

## 1.4. Useful Pandas settings

In [19]:
# float display of 2 decimal places
pd.options.display.float_format = '{:,.2f}'.format

In [20]:
# display up to 100 characters each cell
pd.options.display.max_colwidth = 1000

In [21]:
# display up to 500 columns
pd.options.display.max_columns = 500

In [22]:
# display up to 1000 rows
pd.options.display.max_rows = 1000

# 2. Data exploratory
Data exploratory is an initial analysis step that summarizes the main characteristics to understand what is in the dataset. Data wrangling and data visualization are used for exploratory; however, this topic mentions only data wrangling using Pandas.

## 2.1. Overview

In [23]:
import numpy as np
import pandas as pd

In [24]:
dfYoutube = pd.read_csv('data/youtube_trending.csv')

#### Rows observing

In [25]:
dfYoutube.head()

,video_id,trending_date,channel_title,category_id,publish_time,views,likes,dislikes,comment_count,comments_disabled,ratings_disabled
0,2kyS6SvSYSE,2017-11-14,CaseyNeistat,22,2017-11-13T17:13:01.000Z,748374,57527,2966,15954,False,False
1,1ZAPwfrtAFY,2017-11-14,LastWeekTonight,24,2017-11-13T07:30:00.000Z,2418783,97185,6146,12703,False,False
2,5qpjK5DgCt4,2017-11-14,Rudy Mancuso,23,2017-11-12T19:05:24.000Z,3191434,146033,5339,8181,False,False
3,puqaWrEC7tY,2017-11-14,Good Mythical Morning,24,2017-11-13T11:00:04.000Z,343168,10172,666,2146,False,False
4,d380meD0W0M,2017-11-14,nigahiga,24,2017-11-12T18:01:41.000Z,2095731,132235,1989,17518,False,False

In [26]:
dfYoutube.tail(3)

,video_id,trending_date,channel_title,category_id,publish_time,views,likes,dislikes,comment_count,comments_disabled,ratings_disabled
9878,NEmFS50lsTw,2018-02-01,SKITTLESbrand,24,2018-01-24T15:31:57.000Z,483127,3924,362,506,False,False
9879,NZ0ImXT1FZk,2018-02-01,Brave Wilderness,15,2018-01-24T12:00:02.000Z,1417253,44358,893,6858,False,False
9880,t3z_pdr6z8w,2018-02-01,Jackie Aina,26,2018-01-25T05:05:42.000Z,877585,115391,1621,15749,False,False

In [27]:
dfYoutube.nlargest(n=5, columns='views')

,video_id,trending_date,channel_title,category_id,publish_time,views,likes,dislikes,comment_count,comments_disabled,ratings_disabled
6103,FlsCjmMhFmw,2017-12-14,YouTube Spotlight,24,2017-12-06T17:58:51.000Z,149376127,3093544,1643059,810698,False,False
5860,FlsCjmMhFmw,2017-12-13,YouTube Spotlight,24,2017-12-06T17:58:51.000Z,137843120,3014471,1602383,817582,False,False
5629,FlsCjmMhFmw,2017-12-12,YouTube Spotlight,24,2017-12-06T17:58:51.000Z,125432237,2912702,1545015,807558,False,False
5386,FlsCjmMhFmw,2017-12-11,YouTube Spotlight,24,2017-12-06T17:58:51.000Z,113874632,2811215,1470383,787174,False,False
2558,TyHvyGVs42U,2017-11-26,LuisFonsiVEVO,10,2017-11-17T05:00:01.000Z,102012605,2376636,117196,134224,False,False

In [28]:
dfYoutube.nsmallest(n=5, columns=['category_id', 'likes'])

,video_id,trending_date,channel_title,category_id,publish_time,views,likes,dislikes,comment_count,comments_disabled,ratings_disabled
1416,Kn5UgGQukYQ,2017-11-21,hudsonunionsociety,1,2016-10-14T21:14:51.000Z,15058,0,0,0,True,True
1645,Kn5UgGQukYQ,2017-11-22,hudsonunionsociety,1,2016-10-14T21:14:51.000Z,34207,0,0,0,True,True
1890,Kn5UgGQukYQ,2017-11-23,hudsonunionsociety,1,2016-10-14T21:14:51.000Z,36137,0,0,0,True,True
2093,Kn5UgGQukYQ,2017-11-24,hudsonunionsociety,1,2016-10-14T21:14:51.000Z,36579,0,0,0,True,True
2306,Kn5UgGQukYQ,2017-11-25,hudsonunionsociety,1,2016-10-14T21:14:51.000Z,36931,0,0,0,True,True

#### Features analysis

In [29]:
dfYoutube.shape

(9881, 11)

In [30]:
dfYoutube.columns

Index(['video_id', 'trending_date', 'channel_title', 'category_id',
       'publish_time', 'views', 'likes', 'dislikes', 'comment_count',
       'comments_disabled', 'ratings_disabled'],
      dtype='object')

Pandas automatically detects the data type for each column.

In [31]:
dfYoutube.dtypes

video_id             object
trending_date        object
channel_title        object
category_id           int64
publish_time         object
views                 int64
likes                 int64
dislikes              int64
comment_count         int64
comments_disabled      bool
ratings_disabled       bool
dtype: object

#### Statistical summary

In [32]:
dfYoutube.describe()

       category_id          views        likes     dislikes  comment_count
count     9,881.00       9,881.00     9,881.00     9,881.00       9,881.00
mean         19.97   1,288,899.84    47,460.89     3,066.99       5,817.32
std           7.54   5,110,157.36   170,513.18    38,892.08      30,624.87
min           1.00         687.00         0.00         0.00           0.00
25%          17.00      89,609.00     2,031.00        85.00         273.00
50%          24.00     311,621.00     9,003.00       325.00       1,031.00
75%          25.00   1,001,367.00    29,425.00     1,131.00       3,377.00
max          43.00 149,376,127.00 3,093,544.00 1,643,059.00     827,755.00

In [33]:
# correlation matrix
dfYoutube.corr()

,category_id,views,likes,dislikes,comment_count,comments_disabled,ratings_disabled
category_id,1.00,-0.07,-0.09,0.00,-0.02,0.05,-0.05
views,-0.07,1.00,0.88,0.67,0.78,-0.02,-0.01
likes,-0.09,0.88,1.00,0.53,0.85,-0.03,-0.02
dislikes,0.00,0.67,0.53,1.00,0.76,-0.00,-0.01
comment_count,-0.02,0.78,0.85,0.76,1.00,-0.03,-0.01
comments_disabled,0.05,-0.02,-0.03,-0.00,-0.03,1.00,0.32
ratings_disabled,-0.05,-0.01,-0.02,-0.01,-0.01,0.32,1.00

#### Missing values
Our approach is to calculate the rate of missing values in each column.

In [34]:
dfYoutube.isnull().sum()

video_id             90
trending_date         0
channel_title         0
category_id           0
publish_time          0
views                 0
likes                 0
dislikes              0
comment_count         0
comments_disabled     0
ratings_disabled      0
dtype: int64

In [35]:
dfYoutube.isna().mean().map('{:.0%}'.format)

video_id             1%
trending_date        0%
channel_title        0%
category_id          0%
publish_time         0%
views                0%
likes                0%
dislikes             0%
comment_count        0%
comments_disabled    0%
ratings_disabled     0%
dtype: object

## 2.2. In-depth exploring

In [36]:
import numpy as np
import pandas as pd

In [37]:
dfYoutube = pd.read_csv('data/youtube_trending.csv')

In [38]:
dfYoutube.head()

,video_id,trending_date,channel_title,category_id,publish_time,views,likes,dislikes,comment_count,comments_disabled,ratings_disabled
0,2kyS6SvSYSE,2017-11-14,CaseyNeistat,22,2017-11-13T17:13:01.000Z,748374,57527,2966,15954,False,False
1,1ZAPwfrtAFY,2017-11-14,LastWeekTonight,24,2017-11-13T07:30:00.000Z,2418783,97185,6146,12703,False,False
2,5qpjK5DgCt4,2017-11-14,Rudy Mancuso,23,2017-11-12T19:05:24.000Z,3191434,146033,5339,8181,False,False
3,puqaWrEC7tY,2017-11-14,Good Mythical Morning,24,2017-11-13T11:00:04.000Z,343168,10172,666,2146,False,False
4,d380meD0W0M,2017-11-14,nigahiga,24,2017-11-12T18:01:41.000Z,2095731,132235,1989,17518,False,False

#### Data selection

In [39]:
dfYoutube.channel_title

0                CaseyNeistat
1             LastWeekTonight
2                Rudy Mancuso
3       Good Mythical Morning
4                    nigahiga
                ...
9876                 Nintendo
9877              BURGER KING
9878            SKITTLESbrand
9879         Brave Wilderness
9880              Jackie Aina
Name: channel_title, Length: 9881, dtype: object

In [40]:
dfYoutube['publish_time']

0       2017-11-13T17:13:01.000Z
1       2017-11-13T07:30:00.000Z
2       2017-11-12T19:05:24.000Z
3       2017-11-13T11:00:04.000Z
4       2017-11-12T18:01:41.000Z
                  ...
9876    2018-01-25T21:25:58.000Z
9877    2018-01-24T14:08:29.000Z
9878    2018-01-24T15:31:57.000Z
9879    2018-01-24T12:00:02.000Z
9880    2018-01-25T05:05:42.000Z
Name: publish_time, Length: 9881, dtype: object

In [41]:
# selecting multiple columns as a new dataframe
dfYoutube[['views', 'likes', 'dislikes']].head()

     views   likes  dislikes
0   748374   57527      2966
1  2418783   97185      6146
2  3191434  146033      5339
3   343168   10172       666
4  2095731  132235      1989

The `iloc` and `loc` attributes turn a dataframe into a slicable object with 2 dimensions, like Numpy array. While `iloc` uses index, `loc` uses label on slicing. Notice that `loc` does not exclude the endpoint.

In [42]:
dfYoutube.head()

,video_id,trending_date,channel_title,category_id,publish_time,views,likes,dislikes,comment_count,comments_disabled,ratings_disabled
0,2kyS6SvSYSE,2017-11-14,CaseyNeistat,22,2017-11-13T17:13:01.000Z,748374,57527,2966,15954,False,False
1,1ZAPwfrtAFY,2017-11-14,LastWeekTonight,24,2017-11-13T07:30:00.000Z,2418783,97185,6146,12703,False,False
2,5qpjK5DgCt4,2017-11-14,Rudy Mancuso,23,2017-11-12T19:05:24.000Z,3191434,146033,5339,8181,False,False
3,puqaWrEC7tY,2017-11-14,Good Mythical Morning,24,2017-11-13T11:00:04.000Z,343168,10172,666,2146,False,False
4,d380meD0W0M,2017-11-14,nigahiga,24,2017-11-12T18:01:41.000Z,2095731,132235,1989,17518,False,False

In [43]:
dfYoutube.iloc[2:7, :4]

      video_id trending_date          channel_title  category_id
2  5qpjK5DgCt4    2017-11-14           Rudy Mancuso           23
3  puqaWrEC7tY    2017-11-14  Good Mythical Morning           24
4  d380meD0W0M    2017-11-14               nigahiga           24
5  gHZ1Qz0KiKM    2017-11-14               iJustine           28
6  39idVpFF7NQ    2017-11-14    Saturday Night Live           24

In [44]:
subset = ['channel_title', 'publish_time']
dfYoutube.loc[:5, subset]

           channel_title              publish_time
0           CaseyNeistat  2017-11-13T17:13:01.000Z
1        LastWeekTonight  2017-11-13T07:30:00.000Z
2           Rudy Mancuso  2017-11-12T19:05:24.000Z
3  Good Mythical Morning  2017-11-13T11:00:04.000Z
4               nigahiga  2017-11-12T18:01:41.000Z
5               iJustine  2017-11-13T19:07:23.000Z

#### Filtering

In [45]:
dfYoutube[dfYoutube.views >= 100e6]

,video_id,trending_date,channel_title,category_id,publish_time,views,likes,dislikes,comment_count,comments_disabled,ratings_disabled
2558,TyHvyGVs42U,2017-11-26,LuisFonsiVEVO,10,2017-11-17T05:00:01.000Z,102012605,2376636,117196,134224,False,False
5174,FlsCjmMhFmw,2017-12-10,YouTube Spotlight,24,2017-12-06T17:58:51.000Z,100911567,2656659,1353647,682890,False,False
5386,FlsCjmMhFmw,2017-12-11,YouTube Spotlight,24,2017-12-06T17:58:51.000Z,113874632,2811215,1470383,787174,False,False
5629,FlsCjmMhFmw,2017-12-12,YouTube Spotlight,24,2017-12-06T17:58:51.000Z,125432237,2912702,1545015,807558,False,False
5860,FlsCjmMhFmw,2017-12-13,YouTube Spotlight,24,2017-12-06T17:58:51.000Z,137843120,3014471,1602383,817582,False,False
6103,FlsCjmMhFmw,2017-12-14,YouTube Spotlight,24,2017-12-06T17:58:51.000Z,149376127,3093544,1643059,810698,False,False

In [46]:
dfYoutube[dfYoutube.channel_title.str.contains('VEVO')].head()

,video_id,trending_date,channel_title,category_id,publish_time,views,likes,dislikes,comment_count,comments_disabled,ratings_disabled
32,n1WpP7iowLc,2017-11-14,EminemVEVO,10,2017-11-10T17:00:03.000Z,17158531,787419,43420,125882,False,False
40,PaJCFHXcWmM,2017-11-14,U2VEVO,10,2017-11-13T17:00:04.000Z,60506,5389,106,455,False,False
52,9t9u_yPEidY,2017-11-14,JenniferLopezVEVO,10,2017-11-10T15:00:00.000Z,9548677,190083,15015,11473,False,False
62,ujyTQNNjjDU,2017-11-14,GEazyMusicVEVO,10,2017-11-10T05:00:01.000Z,2642930,115795,3055,6410,False,False
73,lY_0mkYDZDU,2017-11-14,fosterthepeopleVEVO,10,2017-11-10T17:00:05.000Z,303956,18603,585,1745,False,False

In [47]:
dfYoutube[(dfYoutube.views >= 1e7) | (dfYoutube.likes >= 1e5)].head()

,video_id,trending_date,channel_title,category_id,publish_time,views,likes,dislikes,comment_count,comments_disabled,ratings_disabled
2,5qpjK5DgCt4,2017-11-14,Rudy Mancuso,23,2017-11-12T19:05:24.000Z,3191434,146033,5339,8181,False,False
4,d380meD0W0M,2017-11-14,nigahiga,24,2017-11-12T18:01:41.000Z,2095731,132235,1989,17518,False,False
12,5E4ZBSInqUU,2017-11-14,marshmello,10,2017-11-13T17:00:00.000Z,687582,114188,1333,8371,False,False
32,n1WpP7iowLc,2017-11-14,EminemVEVO,10,2017-11-10T17:00:03.000Z,17158531,787419,43420,125882,False,False
52,9t9u_yPEidY,2017-11-14,JenniferLopezVEVO,10,2017-11-10T15:00:00.000Z,9548677,190083,15015,11473,False,False

#### Sorting

In [48]:
dfYoutube.sort_values(by=['trending_date', 'views'], ascending=[True, False]).head()

,video_id,trending_date,channel_title,category_id,publish_time,views,likes,dislikes,comment_count,comments_disabled,ratings_disabled
69,2Vv-BfVoq4g,2017-11-14,Ed Sheeran,10,2017-11-09T11:04:14.000Z,33523622,1634124,21082,85067,False,False
32,n1WpP7iowLc,2017-11-14,EminemVEVO,10,2017-11-10T17:00:03.000Z,17158531,787419,43420,125882,False,False
148,9wg3v-01yKQ,2017-11-14,HarryStylesVEVO,10,2017-11-08T13:00:01.000Z,9632678,810895,16139,59473,False,False
52,9t9u_yPEidY,2017-11-14,JenniferLopezVEVO,10,2017-11-10T15:00:00.000Z,9548677,190083,15015,11473,False,False
68,Jw1Y-zhQURU,2017-11-14,John Lewis,26,2017-11-10T07:38:29.000Z,7224515,55681,10247,9479,False,False

#### Unique values
Unique/distinct values is the basis for many advanced data manipulation techniques.

In [49]:
dfFish = pd.read_csv('data/us_fishery_trade.csv')

In [50]:
dfFish.head()

,Year,Month,Product Name,Country Name,Month number,Value,Feature,Unit
0,2010,January,SABLEFISH FRESH,UNITED ARAB EMIRATES,1,2297,EXP Quantity,kg
1,2010,January,SABLEFISH FRESH,JAPAN,1,16025,EXP Quantity,kg
2,2010,January,SABLEFISH FRESH,JAPAN,1,63437,EXP Quantity,kg
3,2010,January,MONKFISH FRESH,CANADA,1,579,EXP Quantity,kg
4,2010,January,MONKFISH FRESH,CANADA,1,7975,EXP Quantity,kg

In [51]:
dfFish['Product Name'].unique()

array(['SABLEFISH FRESH', 'MONKFISH FRESH', 'WHITEFISH FRESH',
       'WHITEFISH FROZEN', 'MONKFISH FROZEN', 'BUTTERFISH FROZEN',
       'SABLEFISH FROZEN', 'SCORPIONFISH (SCORPAENIDAE) FROZEN',
       'WHITEFISH FILLET FRESH', 'WOLFFISH FILLET BLOCKS FROZEN > 4.5KG',
       'WOLFFISH FILLET FROZEN', 'CRAWFISH FRESHWATER FROZEN',
       'CRAWFISH FRESHWATER PEELED',
       'SABLEFISH SCALED WHETHER OR NOT DRESS FRESH NOT > 6.8KG',
       'WHITEFISH MEAT FROZEN > 6.8KG', 'SABLEFISH FRESH NOT > 6.8KG',
       'WHITEFISH MEAT FRESH',
       'JELLYFISH (RHOPILEMA SPP.) LIVE/FRESH/FROZEN/DRIED/SALTED/BRINE/SMOKED',
       'JELLYFISH PREPARED/PRESERVED'], dtype=object)

In [52]:
dfFish[['Feature', 'Unit']].drop_duplicates()

           Feature Unit
0     EXP Quantity   kg
17    IMP Quantity   kg
8737     EXP Value  USD
8754     IMP Value  USD

#### Data aggregation
Data aggregation is the process splitting the dataset into groups and applying an aggregate function (such as sum, mean, count) to each group.

In [53]:
dfFish.head()

,Year,Month,Product Name,Country Name,Month number,Value,Feature,Unit
0,2010,January,SABLEFISH FRESH,UNITED ARAB EMIRATES,1,2297,EXP Quantity,kg
1,2010,January,SABLEFISH FRESH,JAPAN,1,16025,EXP Quantity,kg
2,2010,January,SABLEFISH FRESH,JAPAN,1,63437,EXP Quantity,kg
3,2010,January,MONKFISH FRESH,CANADA,1,579,EXP Quantity,kg
4,2010,January,MONKFISH FRESH,CANADA,1,7975,EXP Quantity,kg

In [54]:
# number of rows
dfFish.groupby('Product Name').size()

Product Name
BUTTERFISH FROZEN                                                         1398
CRAWFISH FRESHWATER FROZEN                                                1032
CRAWFISH FRESHWATER PEELED                                                1826
JELLYFISH (RHOPILEMA SPP.) LIVE/FRESH/FROZEN/DRIED/SALTED/BRINE/SMOKED     932
JELLYFISH PREPARED/PRESERVED                                               920
MONKFISH FRESH                                                            1816
MONKFISH FROZEN                                                           1288
SABLEFISH FRESH                                                            718
SABLEFISH FRESH NOT > 6.8KG                                                392
SABLEFISH FROZEN                                                          2978
SABLEFISH SCALED WHETHER OR NOT DRESS FRESH NOT > 6.8KG                     44
SCORPIONFISH (SCORPAENIDAE) FROZEN                                        1674
WHITEFISH FILLET FRESH                                                     360
WHITEFISH FRESH                                                            938
WHITEFISH FROZEN                                                           752
WHITEFISH MEAT FRESH                                                       288
WHITEFISH MEAT FROZEN > 6.8KG                                               16
WOLFFISH FILLET BLOCKS FROZEN > 4.5KG                                       34
WOLFFISH FILLET FROZEN                                                      68
dtype: int64

In [55]:
# number of not null values
dfFish.groupby('Product Name').count()

,Year,Month,Country Name,Month number,Value,Feature,Unit
Product Name,,,,,,,
BUTTERFISH FROZEN,1398,1398,1398,1398,1398,1398,1398
CRAWFISH FRESHWATER FROZEN,1032,1032,1032,1032,1032,1032,1032
CRAWFISH FRESHWATER PEELED,1826,1826,1826,1826,1826,1826,1826
JELLYFISH (RHOPILEMA SPP.) LIVE/FRESH/FROZEN/DRIED/SALTED/BRINE/SMOKED,932,932,932,932,932,932,932
JELLYFISH PREPARED/PRESERVED,920,920,920,920,920,920,920
MONKFISH FRESH,1816,1816,1816,1816,1816,1816,1816
MONKFISH FROZEN,1288,1288,1288,1288,1288,1288,1288
SABLEFISH FRESH,718,718,718,718,718,718,718
SABLEFISH FRESH NOT > 6.8KG,392,392,392,392,392,392,392
SABLEFISH FROZEN,2978,2978,2978,2978,2978,2978,2978
SABLEFISH SCALED WHETHER OR NOT DRESS FRESH NOT > 6.8KG,44,44,44,44,44,44,44
SCORPIONFISH (SCORPAENIDAE) FROZEN,1674,1674,1674,1674,1674,1674,1674
WHITEFISH FILLET FRESH,360,360,360,360,360,360,360
WHITEFISH FRESH,938,938,938,938,938,938,938
WHITEFISH FROZEN,752,752,752,752,752,752,752
WHITEFISH MEAT FRESH,288,288,288,288,288,288,288
WHITEFISH MEAT FROZEN > 6.8KG,16,16,16,16,16,16,16
WOLFFISH FILLET BLOCKS FROZEN > 4.5KG,34,34,34,34,34,34,34
WOLFFISH FILLET FROZEN,68,68,68,68,68,68,68

In [56]:
# total export value of each product
dfFish[dfFish['Feature']=='EXP Value']\
    .groupby('Product Name').sum()[['Value']].reset_index()

,Product Name,Value
0,BUTTERFISH FROZEN,10604660
1,CRAWFISH FRESHWATER FROZEN,5393263
2,JELLYFISH (RHOPILEMA SPP.) LIVE/FRESH/FROZEN/DRIED/SALTED/BRINE/SMOKED,5489508
3,JELLYFISH PREPARED/PRESERVED,8198507
4,MONKFISH FRESH,32555268
5,MONKFISH FROZEN,93921677
6,SABLEFISH FRESH,66094664
7,SABLEFISH FROZEN,799896744
8,SCORPIONFISH (SCORPAENIDAE) FROZEN,73262535

In [57]:
# total trade each year
dfFish.groupby(['Feature', 'Year', 'Unit']).sum()['Value'].reset_index()

         Feature  Year Unit      Value
0   EXP Quantity  2010   kg   15578318
1   EXP Quantity  2011   kg   28106436
2   EXP Quantity  2012   kg   15054158
3   EXP Quantity  2013   kg   13856966
4   EXP Quantity  2014   kg   19607838
5   EXP Quantity  2015   kg   17477174
6   EXP Quantity  2016   kg   10759863
7   EXP Quantity  2017   kg   12236928
8   EXP Quantity  2018   kg    9972012
9   EXP Quantity  2019   kg    9990474
10     EXP Value  2010  USD   98236554
11     EXP Value  2011  USD  140983487
12     EXP Value  2012  USD  125953602
13     EXP Value  2013  USD  116650050
14     EXP Value  2014  USD  119094346
15     EXP Value  2015  USD  109798243
16     EXP Value  2016  USD   97552829
17     EXP Value  2017  USD  106999739
18     EXP Value  2018  USD   97991428
19     EXP Value  2019  USD   82156548
20  IMP Quantity  2010   kg   14032723
21  IMP Quantity  2011   kg    8011229
22  IMP Quantity  2012   kg   16405503
23  IMP Quantity  2013   kg   15075456
24  IMP Quantity  2014   kg   14610607
25  IMP Quantity  2015   kg   11491688
26  IMP Quantity  2016   kg   15642463
27  IMP Quantity  2017   kg   13913190
28  IMP Quantity  2018   kg   12914589
29  IMP Quantity  2019   kg   12607424
30     IMP Value  2010  USD  104418740
31     IMP Value  2011  USD   44629635
32     IMP Value  2012  USD  123932304
33     IMP Value  2013  USD  120527354
34     IMP Value  2014  USD  115837518
35     IMP Value  2015  USD   93715779
36     IMP Value  2016  USD  108972260
37     IMP Value  2017  USD   98563992
38     IMP Value  2018  USD  129315579
39     IMP Value  2019  USD   80650686

In [58]:
dfFish[dfFish.Feature.str.contains('Value')]\
    .groupby(['Feature', 'Year', 'Month number']).sum().reset_index()\
    .groupby(['Feature', 'Month number']).mean()['Value'].reset_index()

      Feature  Month number         Value
0   EXP Value             1  4,210,348.90
1   EXP Value             2  3,185,211.90
2   EXP Value             3  3,465,167.20
3   EXP Value             4  8,694,505.80
4   EXP Value             5 14,953,813.70
5   EXP Value             6 15,216,529.70
6   EXP Value             7 12,062,280.30
7   EXP Value             8  9,735,869.90
8   EXP Value             9 10,347,673.50
9   EXP Value            10 10,211,269.20
10  EXP Value            11  9,573,641.90
11  EXP Value            12  7,885,370.60
12  IMP Value             1  6,113,069.10
13  IMP Value             2  3,873,446.40
14  IMP Value             3  4,268,467.30
15  IMP Value             4  2,933,990.00
16  IMP Value             5  3,245,580.70
17  IMP Value             6  7,536,133.30
18  IMP Value             7 15,308,588.20
19  IMP Value             8 18,397,190.00
20  IMP Value             9 15,130,274.20
21  IMP Value            10 10,958,879.70
22  IMP Value            11  7,294,507.20
23  IMP Value            12  6,996,258.60

In [59]:
# apply multiple aggregate functions at once
dfFish.groupby('Product Name').agg([sum, np.mean, np.size])[['Value']].reset_index()

                                                              Product Name  \

0                                                        BUTTERFISH FROZEN
1                                               CRAWFISH FRESHWATER FROZEN
2                                               CRAWFISH FRESHWATER PEELED
3   JELLYFISH (RHOPILEMA SPP.) LIVE/FRESH/FROZEN/DRIED/SALTED/BRINE/SMOKED
4                                             JELLYFISH PREPARED/PRESERVED
5                                                           MONKFISH FRESH
6                                                          MONKFISH FROZEN
7                                                          SABLEFISH FRESH
8                                              SABLEFISH FRESH NOT > 6.8KG
9                                                         SABLEFISH FROZEN
10                 SABLEFISH SCALED WHETHER OR NOT DRESS FRESH NOT > 6.8KG
11                                      SCORPIONFISH (SCORPAENIDAE) FROZEN
12                                                  WHITEFISH FILLET FRESH
13                                                         WHITEFISH FRESH
14                                                        WHITEFISH FROZEN
15                                                    WHITEFISH MEAT FRESH
16                                           WHITEFISH MEAT FROZEN > 6.8KG
17                                   WOLFFISH FILLET BLOCKS FROZEN > 4.5KG
18                                                  WOLFFISH FILLET FROZEN

        Value
          sum       mean  size
0    60432604  43,227.90  1398
1   136660222 132,422.70  1032
2   677768550 371,176.64  1826
3    28905543  31,014.53   932
4    43337180  47,105.63   920
5    38634548  21,274.53  1816
6   120627952  93,655.24  1288
7    84580465 117,800.09   718
8     5882279  15,005.81   392
9   895572564 300,729.54  2978
10     316166   7,185.59    44
11  110342888  65,915.70  1674
12   22307013  61,963.93   360
13  115985398 123,651.81   938
14   39689306  52,778.33   752
15   18866787  65,509.68   288
16     321536  20,096.00    16
17    1718291  50,537.97    34
18    1376420  20,241.47    68

---
*&#9829; By Quang Hung x Thuy Linh &#9829;*